evaluation/two-services/locker-microbenchmark/d100-poker60000000.log
SLOWPOKE_DELAY_MICROS_SERVICE1=100
SLOWPOKE_DELAY_MICROS_SERVICE0=0.0
SLOWPOKE_POKER_BATCH_THRESHOLD=60000000
PROCESSING_TIME_SERVICE0=0.0
PROCESSING_TIME_SERVICE1=0.0005
bash run.sh synthetic two-services 8 512 40000
[run.sh] Running benchmark synthetic with request two-services, thread 8, conn 512, duration 60
[run.sh] Deleting all services
configmap "config-service0" deleted
deployment.apps "service0" deleted
service "service0" deleted
configmap "config-service1" deleted
deployment.apps "service1" deleted
service "service1" deleted
deployment.apps "ubuntu-client" deleted
[run.sh] Waiting for all pods to be deleted
[run.sh] Deploying all services
configmap/config-service0 created
deployment.apps/service0 created
service/service0 created
configmap/config-service1 created
deployment.apps/service1 created
service/service1 created
[run.sh] Client pod not found, deploying client
deployment.apps/ubuntu-client created
[run.sh] Waiting for all pods to be running
[run.sh] All pods are running
[run.sh] Running warmup test
[run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
Running 3s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   200.83ms   54.54ms 460.54ms   71.55%
    Req/Sec   305.55    108.99   494.00     56.67%
  Latency Distribution
     50%  198.86ms
     75%  221.89ms
     90%  259.59ms
     99%  386.47ms
  7307 requests in 3.02s, 2.92MB read
Requests/sec:   2416.25
Transfer/sec:      0.97MB
[run.sh] Speed is 2416.25, duration is 24
[run.sh] Fix the request number.
[run.sh] Running the actual test
[run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d24s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
Running 24s test @ http://service0:80/endpoint1
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   205.04ms   55.96ms 685.15ms   72.22%
    Req/Sec   312.21    108.23   585.00     60.30%
  Latency Distribution
     50%  200.77ms
     75%  223.53ms
     90%  263.76ms
     99%  407.01ms
  40000 requests in 24.00s, 15.98MB read
Requests/sec:   1666.66
Transfer/sec:    681.96KB
------------------------------
stop time: 16.073298
stop time: 15.914929
stop time: 16.107774
stop time: 16.195544
stop time: 16.214700
stop time: 16.155710
stop time: 16.178095
stop time: 16.170414
[run.sh] Checking the resource usage
[run.sh] Test finished with status 0